%%%%%%%%画图
%%%读取txt中的数据，绘制时序图
%%%%%对应  脑电信号时序图.png
clear
clc
x1 = load("E:\大学\大四学年（2019-2020）\下学期\毕设\数据\1\A_Z\Z002.txt");
subplot(5,1,1)
plot(x1)
title("健康志愿者睁眼时正常脑电信号时序图")
x2 = load("E:\大学\大四学年（2019-2020）\下学期\毕设\数据\1\B_O\O002.txt");
subplot(5,1,2)
plot(x2)
title("健康志愿者闭眼时正常脑电信号时序图")
x3 = load("E:\大学\大四学年（2019-2020）\下学期\毕设\数据\1\C_N\N002.txt");
subplot(5,1,3)
plot(x3)
title("癫痫患者发作间期病灶区外脑电信号时序图")
x4 = load("E:\大学\大四学年（2019-2020）\下学期\毕设\数据\1\D_F\F002.txt");
subplot(5,1,4)
plot(x4)
title("癫痫患者发作间期病灶区内脑电信号时序图")
x5 = load("E:\大学\大四学年（2019-2020）\下学期\毕设\数据\1\E_S\S002.txt");
subplot(5,1,5)
plot(x5)
title("癫痫患者发作期脑电信号时序图")